/*
전공
컴공 : 160
화공 : 135
기공 : 123
전공이 컴공인 신입생 5명을 등록하는 쿼리
홍길동, 임꺽정, 유재석, 둘리, 고길동

전공이 화공인 신입생 3명 등록하는 쿼리
나영석,강호동,이둘리st_name`st-num`

전공이 기공인 신입생 3명을 등록하는 쿼리
가나다, 박둘리, 마둘리

*/
USE UNIVERSITY;

insert into student (ST_NUM,ST_NAME,ST_MAJOR) VALUES
("2024160001","홍길동","컴퓨터공학"),
("2024160002","둘리","컴퓨터공학"),
("2024160003","유재석","컴퓨터공학"),
("2024160004","임꺽정","컴퓨터공학"),
("2024160005","고길동","컴퓨터공학");

insert into student (ST_NUM,ST_NAME,ST_MAJOR) VALUES
("2024135001","강호동","화학공학"),
("2024135002","나영석","화학공학"),
("2024135003","이둘리","화학공학");

insert into student (ST_NUM,ST_NAME,ST_MAJOR) VALUES
("2024123001","가나다","기계공학"),
("2024123002","마둘리","기계공학"),
("2024123003","박둘리","기계공학");


